[
    {
        "name": "Mosaic (zurura) - A choose your own adventure game",
        "description": "I architected and implemented the core engine for a 'Choose Your Own Adventure' game designed to immerse players in the vibrant city of Nairobi and its diverse activities. This involved engineering the central game loop and designing the state machine logic to dynamically drive the narrative experience based on player choices. I managed scene presentation, capturing player input, and determining subsequent scenes and narrative outcomes through dynamic branching logic. Complementing the engine, I implemented a flexible Role-Based Access Control (RBAC) system to enable differentiated user experiences. This system defined roles such as Players, who actively engage with the game narrative and make choices; Followers, who observe game progression with restricted interaction; and Architects, granted permissions to administer and modify the game's content and structure, facilitating varied modes of interaction within the game environment. Integral to the design process was a focus on creating an intuitive and visually appealing user experience.",
        "type": "frontend",
        "repo":  "https://github.com/emmanuelmacharia/mosaic",
        "access": "Proprietary",
        "url": "https://mosaic-cyoad.netlify.app",
        "stack": ["Typescript", "React", "NextJS", "drizzle-kit", "SingleStore", "mysql", "zod", "Clerk Auth",  "Tailwind css", "Radix", "T3-Stack"]
    },
    {
        "name": "Google Drive Clone",
        "description": "I developed the core engine for a file management application, providing users with a personal cloud storage solution. This involved engineering the user authentication and authorization framework and designing the folder structure and file upload mechanisms. My work included managing user sign-in, enabling folder creation, and handling file uploads to designated folders. Complementing the engine, I implemented an access control system where users can only view and manage the files they upload. This system defines a User role, where each user has permission to create and manage their own folders and files. Integral to the design process was a focus on creating an intuitive user experience.",
        "type": "frontend",
        "repo":  "https://github.com/emmanuelmacharia/drive-tutorial",
        "access": "Proprietary",
        "url": "",
        "stack": ["Typescript", "React", "NextJS", "drizzle-kit", "SingleStore", "mysql", "zod", "Clerk Auth",  "Tailwind css", "Radix", "T3-Stack", "UploadThing"]
    },
    {
        "name": "Equity Online",
        "description": "A comprehensive digital banking solution designed to povide customers with access to a wide range of banking services. It caters to individuals and businesses in 6 countries, enabling them to perform transactions, manage accounts, get access to credit and other financial tools from anywhere. I play a pivotal role in it's design, development and deployment; spearheading efforts to create a responsive, scalable and secure platform that meets the diverse needs of millions of customers across multiple regions. I work closely with crossfunctional teams including designers, developers, quality assurance analysts, business analysts and data scientists to create a unified and untuitive user experience ",
        "type": "frontend",
        "repo":  "",
        "access": "Proprietary",
        "url": "https://equityonline.equitygroupholdings.com",
        "stack": ["Javascript", "Typescript", "Angular", "Jest", "scss", "C#", ".NET Framework", "Azure", "Docker", "Kubernetes"]
    },
    {
        "name": "Aerial Datalabs",
        "description": "A dynamic platform designed to provide advanced data visualization and analysis tools for geospacial and aerial drone data. I was instrumental in developing and deploying the solution across both the frontend and the backend, implementing a responsive and user friendly interface that allow users to easily monitor their stockpiles, and maintaining robust APIs for optimised processing and report generation",
        "type": "frontend",
        "repo":  "",
        "access": "Proprietary",
        "url": "https://aerialdatalabs.copilot.app/",
        "stack": ["Javascript", "React", "Python", "Django", "MapBox", "GDAL", "scss", "React Query",  "MUI", "Styled Components", "Puppeteer",  "AWS", "Github Actions", "Sentry"]
    },
    {
        "name": "Portfolio v1",
        "description": "A web application that describes me as a professional, and showcases my work",
        "type": "frontend",
        "repo":  "https://github.com/emmanuelmacharia/portfolio",
        "access": "Public",
        "url": "https://emmanuelmacharia.com",
        "stack": ["reactjs", "react-router", "scss", "react-fontawesome"]
    },
    {
        "name": "Event Scrubber",
        "description": "An application that lets one view, manage and browse through events. It's a front end application built on angular 2. It's a project built through learning angular. A user can sign in and sign out, create, search and filter events and vote for sessions in the application",
        "type": "frontend",
        "repo":  "https://github.com/emmanuelmacharia/EventsApplication",
        "access": "Public",
        "url": "",
        "stack": ["Angular", "Toastr", "NodeJS", "Javascript", "bootstrap"]
    },
    {
        "name": "Javascript Development Environment",
        "description": "A boiler plate project tht helps you get you up and running quickly on Javascript projects. It giudes decisions on bundling, transpiling, liniting, unit-testing and deployment and much much more. It's a frictionless boilerplate so you can easily change configurations, scripts and technologies",
        "type": "script",
        "repo":  "https://github.com/emmanuelmacharia/JavaScript-Development-Environment",
        "access": "Public",
        "url": "",
        "stack": ["webpack", "babel", "mocha-chai", "express", "npm-scripts"]
    },
    {
        "name": "Pomodoro clock",
        "description": "The Pomodoro Technique is a time management method developed by Francesco Cirillo in the late 1980s. The technique uses a timer to break down work into intervals, traditionally 25 minutes in length, separated by short breaks. Each interval is known as a pomodoro, from the Italian word for 'tomato', after the tomato-shaped kitchen timer that Cirillo used as a university student.",
        "type": "frontend",
        "repo":  "https://github.com/emmanuelmacharia/portfolio",
        "access": "Public",
        "url": "",
        "stack": ["reactjs", "react-router", "scss", "react-fontawesome"]
    },
    {
        "name": "Questioner-database-integration",
        "description": "Crowd-source questions for a meetup. Questioner helps the meetup organizer prioritize questions to be answered. Other users can vote on asked questions and they bubble to the top or bottom of the log. This has a postgres database set up",
        "type": "backend",
        "repo":  "https://github.com/emmanuelmacharia/Questioner-Database-Integration",
        "access": "Public",
        "url": "",
        "stack": ["python3", "postgresql", "flask", "psycopg2"]
    }
]